In [1]:
import numpy as np
import pandas as pd

In [2]:
my_dict = {"A" : [10,20,30,np.nan] ,"B" : [np.nan,2,33,44] ,"C" : [12,np.nan,44,54] , "E" : [10,20,40,60]}

In [3]:
my_data_frame = pd.DataFrame(my_dict)

In [4]:
my_dict

{'A': [10, 20, 30, nan],
 'B': [nan, 2, 33, 44],
 'C': [12, nan, 44, 54],
 'E': [10, 20, 40, 60]}

In [5]:
my_data_frame

      A     B     C   E
0  10.0   NaN  12.0  10
1  20.0   2.0   NaN  20
2  30.0  33.0  44.0  40
3   NaN  44.0  54.0  60

In [6]:
my_data_frame.dropna # değeri nan olanları at dropna

<bound method DataFrame.dropna of       A     B     C   E
0  10.0   NaN  12.0  10
1  20.0   2.0   NaN  20
2  30.0  33.0  44.0  40
3   NaN  44.0  54.0  60>

In [7]:
my_data_frame.dropna(axis=1)

    E
0  10
1  20
2  40
3  60

In [8]:
my_new_dict = {"A" : [10,20,30,np.nan] ,"B" : [np.nan,2,33,44] ,"C" : [12,np.nan,44,54] , "E" : [10,20,40,60], "D": [np.nan,np.nan,np.nan,np.nan]}

In [9]:
my_new_data_frame = pd.DataFrame(my_new_dict) # yeni dataframe oluştur

In [10]:
my_new_data_frame

      A     B     C   E   D
0  10.0   NaN  12.0  10 NaN
1  20.0   2.0   NaN  20 NaN
2  30.0  33.0  44.0  40 NaN
3   NaN  44.0  54.0  60 NaN

In [13]:
my_new_data_frame.dropna(axis=1 ,thresh=2) # axis = 0 column 1 = row thresh eşik değeri ni aşmayanları at

      A     B     C   E
0  10.0   NaN  12.0  10
1  20.0   2.0   NaN  20
2  30.0  33.0  44.0  40
3   NaN  44.0  54.0  60

In [14]:
my_new_data_frame.fillna(25) # nan olan verileri doldur

      A     B     C   E     D
0  10.0  25.0  12.0  10  25.0
1  20.0   2.0  25.0  20  25.0
2  30.0  33.0  44.0  40  25.0
3  25.0  44.0  54.0  60  25.0

In [15]:
#group

In [16]:
my_dict1 = {"Language" : ["Py","Py","Py","C","C"] ,"person": ["a","b","c","d","e"],"salry":[10,200,44,50,100]}

In [17]:
my_dataFrame = pd.DataFrame(my_dict1)

In [18]:
my_dataFrame

  Language person  salry
0       Py      a     10
1       Py      b    200
2       Py      c     44
3        C      d     50
4        C      e    100

In [21]:
my_group_object = my_dataFrame.groupby("Language") # grupla

In [24]:
my_group_object.count()# hangi grupta kaç kişi var

          person  salry
Language
C              2      2
Py             3      3

In [26]:
my_group_object.min()

         person  salry
Language
C             d     50
Py            a     10

In [27]:
my_group_object.min("salry")

          salry
Language
C            50
Py           10

In [28]:
my_group_object.describe() # genel özet

         salry
         count       mean         std   min   25%   50%    75%    max
Language
C          2.0  75.000000   35.355339  50.0  62.5  75.0   87.5  100.0
Py         3.0  84.666667  101.317981  10.0  27.0  44.0  122.0  200.0

In [ ]:
# adiontinal operations

In [29]:
myDict1 = {"Name" : ["A","B","C","D"],
           "Soorts" : ["Futbaal","Basketbaal","Swiming","Runing"],
           "Calories" : [100,300,88,80]
}

In [41]:
myDataFrame1 = pd.DataFrame(myDict1,index=[1,2,3,4])

In [42]:
myDataFrame1

  Name      Soorts  Calories
1    A     Futbaal       100
2    B  Basketbaal       300
3    C     Swiming        88
4    D      Runing        80

In [43]:
myDict2 = {"Name" : ["E","F","G","K"],
           "Soorts" : ["Futbaal","Basketbaal","Swiming","Runing"],
           "Calories" : [100,350,38,500]
}
myDict3 = {"Name" : ["L","M","N","O"],
           "Soorts" : ["Futbaal","Basketbaal","Swiming","Runing"],
           "Calories" : [140,300,83,330]
}

In [44]:
myDataFrame2 = pd.DataFrame(myDict2,index=[5,6,7,8])
myDataFrame3 = pd.DataFrame(myDict3,index=[9,10,11,12])

In [45]:
myDataFrame1
myDataFrame2
myDataFrame3

   Name      Soorts  Calories
9     L     Futbaal       140
10    M  Basketbaal       300
11    N     Swiming        83
12    O      Runing       330

In [46]:
myDataFrame3

   Name      Soorts  Calories
9     L     Futbaal       140
10    M  Basketbaal       300
11    N     Swiming        83
12    O      Runing       330

In [47]:
#concatenition

In [48]:
pd.concat([myDataFrame1,myDataFrame2,myDataFrame3]) # üç farklı dataFrameyi birleştirme

   Name      Soorts  Calories
1     A     Futbaal       100
2     B  Basketbaal       300
3     C     Swiming        88
4     D      Runing        80
5     E     Futbaal       100
6     F  Basketbaal       350
7     G     Swiming        38
8     K      Runing       500
9     L     Futbaal       140
10    M  Basketbaal       300
11    N     Swiming        83
12    O      Runing       330

In [49]:
# merge

In [50]:
myDataFrame1

  Name      Soorts  Calories
1    A     Futbaal       100
2    B  Basketbaal       300
3    C     Swiming        88
4    D      Runing        80

In [51]:
myDataFrame2

  Name      Soorts  Calories
5    E     Futbaal       100
6    F  Basketbaal       350
7    G     Swiming        38
8    K      Runing       500

In [52]:
pd.merge(myDataFrame1,myDataFrame2,on="Soorts") # sports u baaz alarak merge yaptı

  Name_x      Soorts  Calories_x Name_y  Calories_y
0      A     Futbaal         100      E         100
1      B  Basketbaal         300      F         350
2      C     Swiming          88      G          38
3      D      Runing          80      K         500

In [53]:
my_dataFrame

  Language person  salry
0       Py      a     10
1       Py      b    200
2       Py      c     44
3        C      d     50
4        C      e    100

In [55]:
my_dataFrame["Language"].unique()

array(['Py', 'C'], dtype=object)

In [58]:
def hesap(salry):
    return salry * 0.22

In [59]:
my_dataFrame["salry"].apply(hesap)

0     2.20
1    44.00
2     9.68
3    11.00
4    22.00
Name: salry, dtype: float64